
Orient up to 90°

wall height = 8'
6" walls

living = rectangle 38' x 14'6" with:
  opening on bottom wall 4' wide, 5'9" from left ("living-family")
  opening on right wall 6' wide, 4'6" from top
  window on top wall 5'11" wide, 5'3" from left, XX" from floor, XX" from ceiling
  6 windows on top wall XX' wide, 5'6" from right, XX" from floor, XX" from ceiling, XX" between windows

garage = rectangle 26' x 27'6" with:
  door on right wall 3' wide, 6" from bottom ("garage-family")
  door on bottom wall 3' wide, 2" from right
  window on top, XX" wide, XX" from left, XX" from floor, XX" from ceiling
  window on top, XX" wide, XX" from right, XX" from floor, XX" from ceiling
  garagedoor on left, XX" wide, XX" from bottom
  garagedoor on left, XX" wide, XX" from top

 family = path heading right go 8'6", turn right, go 12', turn left, go 35',
              turn left, go 16', turn left, go 43'6", turn left, go 4'
  door on left, 3' wide, 6" from top ("garage-family")
  opening on top, 4' wide, 4' from left ("living-family")
  door on bottom, XX" wide, XX" from right, XX" from floor, XX" from ceiling
  opening on top, XX" wide, 6" from right
  patiodoor on bottom, XX" wide, 10'3" from right
  window on bottom, XX" wide, XX" from right, XX" from floor, XX" from ceiling
  window on bottom, XX" wide, XX" from right, XX" from floor, XX" from ceiling
  window on bottom, XX" wide, XX" from right, XX" from floor, XX" from ceiling

*** Try out templating to Metapost directly from Python

#+begin_src python :results output
def draw(*args):
    path = '--'.join([f'({x}ft,{y}ft)' for x, y in args])
    print(f'draw {path}--cycle;')

print('ft = 1cm; pickup pensquare scaled 1bp;')
draw((0,0), (26,0), (26,27.5), (0,27.5))
print('pickup pensquare scaled 0.5ft;')

#+end_src

#+RESULTS:
: ft = 1cm; pickup pensquare scaled 1bp;
: draw (0ft,0ft)--(26ft,0ft)--(26ft,27.5ft)--(0ft,27.5ft)--cycle;
: pickup pensquare scaled 0.5ft;

